 
   {
    "title" : "How to learn MERN stack ",
    "content" : "MEAN (MongoDB, Express.js, AngularJS (or Angular), and Node.js)[1] is a source-available JavaScript software stack for building dynamic web sites and web applications.[2] A variation known as MERN replaces Angular with React.js front-end,[3][4] and another named MEVN use Vue.js as front-end.Because all components of the MEAN stack support programs that are written in JavaScript, MEAN applications can be written in one language for both server-side and client-side execution environments. Though often compared directly to other popular web development stacks such as the LAMP stack, the components of the MEAN stack are higher-level including a web application presentation layer and not including an operating system layer.[5] The acronym MEAN was coined by Valeri Karpov.[6] He introduced the term in a 2013 blog post and the logo concept, initially created by Austin Anderson for the original MEAN stack LinkedIn group, is an assembly of the first letter of each component of the MEAN acronym.[7] Software components MongoDB Main article: MongoDB MongoDB is a NoSQL database program that uses JSON-like BSON (binary JSON) documents with schema. The role of the database in the MEAN stack is very commonly filled by MongoDB because its use of JSON-like documents for interacting with data as opposed to the row/column model allows it to integrate well with the other (JavaScript-based) components of the stack.[8] Express.js Main article: Express.js Express.js (also referred to as Express) is a modular web application framework package for Node.js.[9] While Express is capable of acting as an internet-facing web server, even supporting SSL/TLS out of the box, it is often used in conjunction with a reverse proxy such as NGINX or Apache for performance reasons.[10] Angular and alternatives Main articles: Angular (web framework), React (JavaScript library), and Vue.js Typically data is fetched using Ajax techniques and rendered in the browser on the client-side by a client-side application framework, however as the stack is commonly entirely JavaScript-based, in some implementations of the stack, server-side rendering where the rendering of the initial page can be offloaded to a server is used so that the initial data can be prefetched before it is loaded in the user's browser.[11] Node.js Main article: Node.js Node.js is the application runtime that the MEAN stack runs on. The use of Node.js, which is said to represent a JavaScript Everywhere paradigm,[12] is integral to the MEAN stack which relies on that concept.",
    "author" : "Rehman khan",
    "slug" : "how-to-learn-mern"
 
   }
 